{
  "backend/main.mo": "Defines an actor with extensive types for media processing jobs, including audio/video processing flags, metadata, and storage/mixin integrations.",
  "feature_evidence.json": "Lists feature evidence reports mapping feature IDs to related frontend files, components, and test identifiers.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files for reference in build planning.",
  "frontend/index.css": "Defines Tailwind base variables and OKLCH-themed light/dark color tokens for global styling.",
  "frontend/index.html": "HTML entry point loading the app root and lamejs for MP3 encoding.",
  "frontend/src/App.tsx": "Main React app component managing authentication state, profile setup, and routing to login or dashboard.",
  "frontend/src/components/AdvancedAudioEditor.tsx": "Audio editor UI implementing auto/manual DSP configuration, waveform/spectral displays, and processing via browser DSP pipeline.",
  "frontend/src/components/AudioABPreviewPlayer.tsx": "Audio player allowing A/B comparison between original and edited tracks with playback, seeking, and volume controls.",
  "frontend/src/components/DualWaveformDisplay.tsx": "Canvas-based waveform visualizer using Web Audio API to draw real‑time audio data from a provided audio element.",
  "frontend/src/components/FileUpload.tsx": "Handles media upload, validation, processing flow, and video preview logic with extensive UI controls for editing options.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle and Internet Identity login/logout handling.",
  "frontend/src/components/JobsList.tsx": "Displays user's processing history placeholder with mode-specific icons and messaging.",
  "frontend/src/components/LoginPrompt.tsx": "Landing page prompting login, featuring marketing content and feature highlights for the editing suite.",
  "frontend/src/components/NLEEditor.tsx": "Empty placeholder file for a future non-linear editor component.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting users to enter and save their name when creating a new profile.",
  "frontend/src/components/SpectralFrequencyDisplay.tsx": "Canvas-based frequency visualizer that initializes an AudioContext analyser and renders animated spectral bars for a given audio element.",
  "frontend/src/components/UnifiedVideoEditor.tsx": "Large video editor component handling clips, playback, effects management, and timeline interactions with extensive UI controls and state management.",
  "frontend/src/components/VideoComparison.tsx": "Side‑by‑side video comparison tool with synchronized playback, volume controls, and optional real‑time neural enhancement previews.",
  "frontend/src/components/VideoPreviewManager.tsx": "Simple UI panel for toggling preview effects, serving as a placeholder requiring backend integration for real‑time video enhancements.",
  "frontend/src/docs/video-smoke-test-checklist.md": "Markdown checklist outlining workflows and tests to verify end‑to‑end video editing, comparison, export, and UI behavior.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, auto‑refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, logout, stored identity loading, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles and uploading media via an actor API.",
  "frontend/src/index.css": "Tailwind base styling with extensive CSS variables for themes including light and dark modes.",
  "frontend/src/lib/aiAudioOrchestrator.ts": "Utility for analyzing audio, generating AI processing plans from prompts, and summarizing selected audio enhancements.",
  "frontend/src/lib/audioProcessor.ts": "Web Audio–based DSP engine that applies multi-stage audio processing such as noise suppression, voice isolation, and EQ.",
  "frontend/src/lib/autoAudioAssessment.ts": "Extracts detailed audio features and suggests DSP settings using in-browser signal analysis.",
  "frontend/src/lib/autoDspAutoTune.ts": "Builds DSP processing options by auto-tuning settings based on analyzed audio features and intensity scaling.",
  "frontend/src/lib/dsp/dspTypes.ts": "Defines shared DSP option types and helper functions for mapping strength values to audio parameters.",
  "frontend/src/lib/dsp/stageBuilders.ts": "Implements Web Audio DSP stage builders for noise, transient, and voice processing using strength-based parameter mapping.",
  "frontend/src/main.tsx": "Initializes React, Internet Identity provider, and React Query before rendering the app.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tabs for the video editor, file upload, and processing history.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Describes the project’s architecture, state version, design direction, and known issues for the Auvid app."
}