{
  "backend/main.mo": "Defines the actor and extensive types for media processing jobs, including audio/video editing flags, metadata, and storage integration.",
  "feature_evidence.json": "Lists feature evidence reports mapping requested DSP and UI features to relevant frontend files and components.",
  "frontend-file-summaries.txt": "Aggregates brief summaries of multiple frontend files describing their roles in the app architecture.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point including lamejs for MP3 encoding and loading the React app.",
  "frontend/src/App.tsx": "Main React app component handling authentication, profile setup flow, and routing to dashboard or login.",
  "frontend/src/components/AdvancedAudioEditor.tsx": "Full in-browser audio editor UI with DSP controls, strength sliders, previews, and processing workflow.",
  "frontend/src/components/AudioABPreviewPlayer.tsx": "Audio player component allowing A/B comparison between original and edited audio with playback, seeking, volume, and source switching.",
  "frontend/src/components/DualWaveformDisplay.tsx": "Canvas-based waveform visualizer that uses an AnalyserNode to draw real-time audio waveforms from a provided audio element.",
  "frontend/src/components/FileUpload.tsx": "Handles audio/video file selection, validation, upload, processing options, and preview, supporting multiple editing modes and progress tracking.",
  "frontend/src/components/Footer.tsx": "Static footer displaying branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle and Internet Identity login/logout handling.",
  "frontend/src/components/JobsList.tsx": "Displays user job history placeholder UI with mode-specific icons and loading state.",
  "frontend/src/components/LoginPrompt.tsx": "Landing page prompting user login with marketing content and feature highlights for the editing suite.",
  "frontend/src/components/NLEEditor.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting the user to enter their name and create a profile via a backend mutation.",
  "frontend/src/components/SpectralFrequencyDisplay.tsx": "Canvas-based audio frequency visualizer that initializes an analyser node from an HTMLAudioElement and renders animated spectral bars.",
  "frontend/src/components/UnifiedVideoEditor.tsx": "Large unified video editor component managing timeline clips, video playback, and numerous AI-driven video effects with React state and refs.",
  "frontend/src/components/VideoComparison.tsx": "Side‑by‑side video comparison player with synchronized playback, effect-aware rendering, and optional real-time neural preview logic.",
  "frontend/src/components/VideoPreviewManager.tsx": "Minimal UI for toggling video enhancement effects and emitting layer/effect changes for previews.",
  "frontend/src/docs/video-smoke-test-checklist.md": "Markdown checklist outlining smoke tests for video upload, editing, preview, comparison, history, and export workflows.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on Internet Identity, auto‑invalidating dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing authentication state, identity loading, login, logout, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles and uploading media with extensive AI effect parameters.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes, setting color tokens and global styling.",
  "frontend/src/lib/aiAudioOrchestrator.ts": "Implements audio analysis, AI-driven audio processing plan generation, and summarization based on user prompts.",
  "frontend/src/lib/audioProcessor.ts": "Runs multi-stage DSP audio processing in the browser using Web Audio API, including noise suppression, isolation, EQ, and repair.",
  "frontend/src/lib/dsp/dspTypes.ts": "Declares DSP configuration types and utilities for mapping strength values into DSP parameters.",
  "frontend/src/lib/dsp/stageBuilders.ts": "Builds reusable Web Audio DSP chains such as noise suppression, transient reduction, and voice isolation.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/Dashboard.tsx": "React dashboard page with tabbed navigation for video editor, file upload, and job history, wiring state for mode selection and refresh on upload.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, container settings, animations, and plugin setup.",
  "project_state.json": "Project metadata describing app architecture, current goals, and known issues for the React + Motoko media editing system."
}