{
  "backend/main.mo": "Defines actor with storage mixin and extensive ProcessingJob types for audio/video editing metadata and job tracking.",
  "feature_evidence.json": "Feature evidence report mapping requested features to relevant frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-written summaries of various frontend components and utilities for reference.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color system and light/dark theme variables.",
  "frontend/index.html": "HTML entry point loading root app container, Vite script, and lamejs for MP3 encoding.",
  "frontend/src/App.tsx": "Main app component managing authentication state, profile setup, and routing to dashboard or login.",
  "frontend/src/components/AdvancedAudioEditor.tsx": "Full-featured audio editor with AI processing controls, visualization displays, and processing workflow management.",
  "frontend/src/components/AudioABPreviewPlayer.tsx": "Audio player allowing A/B comparison between original and edited audio with playback, seeking, and volume controls.",
  "frontend/src/components/DualWaveformDisplay.tsx": "Canvas-based audio waveform visualizer using Web Audio API analyser data.",
  "frontend/src/components/FileUpload.tsx": "Handles uploading audio/video files, validation, previewing, and triggering backend processing with progress tracking.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying branding and external link attribution.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle and Internet Identity login/logout handling.",
  "frontend/src/components/JobsList.tsx": "Displays user's job history or placeholder message based on selected mode.",
  "frontend/src/components/LoginPrompt.tsx": "Landing page prompting user login with marketing content and feature highlights.",
  "frontend/src/components/NLEEditor.tsx": "Empty placeholder file for future non-linear editor component.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog for collecting and saving user's name during initial profile setup.",
  "frontend/src/components/SpectralFrequencyDisplay.tsx": "Renders a canvas-based audio frequency visualizer using Web Audio API and an analyser node tied to an HTMLAudioElement.",
  "frontend/src/components/UnifiedVideoEditor.tsx": "Provides a complex video editing UI with timeline clips, real-time effect controls, and state for playback, rendering, and neural enhancements.",
  "frontend/src/components/VideoComparison.tsx": "Displays side-by-side original and edited videos with synced playback and optional real-time effect rendering using canvas processing.",
  "frontend/src/components/VideoPreviewManager.tsx": "UI panel for toggling and adjusting video enhancement effects, notifying parent components of changes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context/provider for handling Internet Identity login, persistence, and related state.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls in React Query hooks for user profiles and media uploads, including mutations and query invalidation.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH CSS variables for light/dark themes with global border and body styling.",
  "frontend/src/lib/aiAudioOrchestrator.ts": "Provides prompt-driven audio processing plan generation and simple browser-based audio analysis utilities.",
  "frontend/src/lib/audioProcessor.ts": "Implements a multi‑stage AI-enhanced audio processing pipeline using Web Audio API with noise suppression, isolation, repair, and EQ.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider and mounts the root component.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tabs for video editing, file upload, and job history management.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters for routing and state persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors via OKLCH variables, animations, radius, and enabling plugins.",
  "project_state.json": "Contains metadata describing the project's version, architecture, workflows, and known issues for a React + Motoko media‑processing application. Highlights frontend–backend structure, authentication, job handling, audio/video processing methods, and existing technical problems."
}