{
  "kind": "build_request",
  "title": "Add triple-check audio diagnostics to trace and fix post-processing static in recordings",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a \"Triple Check\" audio diagnostics system that identifies where static/artifacts are introduced by comparing (1) decoded input audio, (2) audio after early pipeline processing, and (3) final processed/encoded output, and surface the results in the UI.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "implement a triple checking system element to check this system to figure out why and where the static after processing is coming from and fix the error that's causing the static/errors in recording"
        ]
      },
      "acceptanceCriteria": [
        "User can run a Triple Check from the audio processing UI and it completes without crashing for a supported audio file.",
        "Triple Check produces three checkpoints that correspond to: decoded input, an intermediate processed stage, and final processed stage.",
        "UI displays a clear per-checkpoint summary including sample rate, channel count, duration, peak level, RMS level, DC offset estimate, NaN/Infinity sample count, and an estimated clipping count.",
        "UI highlights which checkpoint first introduces abnormal values (e.g., clipping spikes, NaNs, extreme DC offset) and labels that checkpoint as the likely source stage.",
        "User can audition each checkpoint audio (e.g., via selectable playback) to confirm where static begins.",
        "User can download a diagnostic report (JSON or text) containing metrics and selected processing settings used during the run."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add pipeline checkpoint support to the in-browser DSP processor so that the audio can be rendered and inspected at multiple stages without changing the user’s chosen DSP settings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "implement a triple checking system element to check this system to figure out why and where the static after processing is coming from"
        ]
      },
      "acceptanceCriteria": [
        "The DSP processing layer (currently `processAudioWithDSP` in `frontend/src/lib/audioProcessor.ts`) supports running with checkpoints (e.g., returns intermediate AudioBuffers or renders stage-by-stage) while still returning the final AudioBuffer.",
        "Checkpoint rendering is deterministic for the same input and settings (no random noise added).",
        "Checkpoint rendering does not regress the existing non-diagnostic processing path (normal processing still returns only the final result when diagnostics are not enabled)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the error(s) that can cause static/artifacts after processing by hardening the decode → DSP → encode path with audio-safety validations and robust resource cleanup.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix the error that's causing the static/errors in recording"
        ]
      },
      "acceptanceCriteria": [
        "Audio processing always closes any created `AudioContext` even if decode, DSP, or encode throws (no leaked contexts).",
        "WAV encoding clamps and sanitizes samples to prevent NaN/Infinity propagation into the output file (NaNs/Infs become 0 and are counted in diagnostics).",
        "WAV encoding uses safe int16 conversion (including rounding) and does not write out-of-range values.",
        "If the processed buffer contains abnormal values (NaN/Infinity, excessive clipping), the UI surfaces a clear error/warning message in English and recommends lowering DSP strengths or disabling the stage flagged by diagnostics.",
        "After the fix, running processing on a typical audio file no longer introduces new constant static that was not present in the decoded input (verified by diagnostics: clipping/NaN counts do not spike only at the final encode step)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Expose a user-facing \"Diagnostics\" section in the Advanced Audio Editor that enables running Triple Check, viewing results, and exporting the report, without requiring backend changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "implement a triple checking system element"
        ]
      },
      "acceptanceCriteria": [
        "Advanced Audio Editor includes a Diagnostics UI section that is discoverable and does not block normal processing.",
        "Diagnostics section includes: a button to run Triple Check, a results table/card list for the three checkpoints, and a button to download the report.",
        "All user-facing diagnostics labels and messages are in English.",
        "Diagnostics run does not automatically upload anything to the backend; it is local-only unless the user explicitly uploads/export via existing flows."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (read-only UI components must be composed, not modified).",
    "Do not modify immutable hook files: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`.",
    "Backend must remain a single Motoko actor in `backend/main.mo`; add backend changes only if strictly required for diagnostics.",
    "No third-party realtime or external logging services; diagnostics must run in-browser and/or within existing IC canister patterns."
  ],
  "nonGoals": [
    "Implementing WebSocket-based real-time audio streaming or live remote debugging.",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Adding external database/storage systems outside the canister architecture.",
    "Building a brand-new recording feature if one does not already exist; scope is to diagnose and fix static/errors in the existing decode/process/encode pipeline."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}