{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Triple Check in-browser audio diagnostics and pipeline hardening",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a Triple Check diagnostics run that compares decoded input, an early pipeline checkpoint, and final processed/encoded output and surfaces metrics, source-stage highlighting, auditioning, and report export in the UI.",
      "acceptanceCriteria": [
        "User can run a Triple Check from the audio processing UI and it completes without crashing for a supported audio file.",
        "Triple Check produces three checkpoints that correspond to: decoded input, an intermediate processed stage, and final processed stage.",
        "UI displays a clear per-checkpoint summary including sample rate, channel count, duration, peak level, RMS level, DC offset estimate, NaN/Infinity sample count, and an estimated clipping count.",
        "UI highlights which checkpoint first introduces abnormal values (e.g., clipping spikes, NaNs, extreme DC offset) and labels that checkpoint as the likely source stage.",
        "User can audition each checkpoint audio (e.g., via selectable playback) to confirm where static begins.",
        "User can download a diagnostic report (JSON or text) containing metrics and selected processing settings used during the run."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/tripleCheckDiagnostics.ts",
          "operation": "create",
          "description": "Implement the in-browser Triple Check runner that (a) decodes the input, (b) requests checkpoint rendering from the DSP layer, (c) encodes/decodes the final output to isolate encode-step artifacts, (d) computes per-checkpoint metrics (sample rate, channels, duration, peak, RMS, DC offset estimate, NaN/Infinity count, clipping estimate), and (e) produces a JSON-serializable diagnostic report for UI export."
        },
        {
          "path": "frontend/src/lib/audioMetrics.ts",
          "operation": "create",
          "description": "Add reusable audio analysis utilities to compute numeric metrics from an AudioBuffer/Float32Array, including peak/RMS, DC offset estimate, NaN/Infinity counts, and an estimated clipping count used by Triple Check summaries and warnings."
        },
        {
          "path": "frontend/src/components/TripleCheckResults.tsx",
          "operation": "create",
          "description": "Create a UI component that renders the three-checkpoint results (table/cards), highlights the first abnormal checkpoint as the likely source stage, provides checkpoint selection for auditioning, and exposes a Download Report action. Compose existing shadcn/ui components (do not modify anything under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdvancedAudioEditor.tsx",
          "operation": "modify",
          "description": "Wire a Triple Check action into the Advanced Audio Editor: invoke the Triple Check runner with the user's current DSP settings, render results via the TripleCheckResults component, provide checkpoint auditioning using locally generated object URLs, and enable report download (local-only) without uploading anything to the backend. Compose existing shadcn/ui components (do not modify anything under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add deterministic checkpoint rendering support to the in-browser DSP processor so diagnostics can inspect multiple stages without changing user DSP settings and without affecting normal processing behavior.",
      "acceptanceCriteria": [
        "The DSP processing layer (currently `processAudioWithDSP` in `frontend/src/lib/audioProcessor.ts`) supports running with checkpoints (e.g., returns intermediate AudioBuffers or renders stage-by-stage) while still returning the final AudioBuffer.",
        "Checkpoint rendering is deterministic for the same input and settings (no random noise added).",
        "Checkpoint rendering does not regress the existing non-diagnostic processing path (normal processing still returns only the final result when diagnostics are not enabled)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/audioProcessor.ts",
          "operation": "modify",
          "description": "Extend processAudioWithDSP with an optional diagnostics/checkpoints mode that can render and return intermediate AudioBuffers for selected stages (e.g., decoded input passthrough, early pipeline, final pipeline) while preserving the existing default behavior (return only the final AudioBuffer when diagnostics are not enabled). Ensure the implementation remains deterministic for identical input and settings."
        },
        {
          "path": "frontend/src/lib/dsp/dspTypes.ts",
          "operation": "modify",
          "description": "Add minimal type support for DSP diagnostics/checkpoint configuration and return types (e.g., optional diagnostics options and a structured return for checkpoints) while keeping the existing options compatible for normal processing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Harden the decode → DSP → encode path to prevent static/artifacts by adding audio-safety validations, NaN/Infinity sanitization, safe int16 conversion, robust AudioContext cleanup, and clear UI warnings when abnormal values are detected.",
      "acceptanceCriteria": [
        "Audio processing always closes any created `AudioContext` even if decode, DSP, or encode throws (no leaked contexts).",
        "WAV encoding clamps and sanitizes samples to prevent NaN/Infinity propagation into the output file (NaNs/Infs become 0 and are counted in diagnostics).",
        "WAV encoding uses safe int16 conversion (including rounding) and does not write out-of-range values.",
        "If the processed buffer contains abnormal values (NaN/Infinity, excessive clipping), the UI surfaces a clear error/warning message in English and recommends lowering DSP strengths or disabling the stage flagged by diagnostics.",
        "After the fix, running processing on a typical audio file no longer introduces new constant static that was not present in the decoded input (verified by diagnostics: clipping/NaN counts do not spike only at the final encode step)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/wavEncoder.ts",
          "operation": "create",
          "description": "Centralize WAV encoding into a hardened utility that sanitizes NaN/Infinity samples (set to 0 and count), clamps to [-1, 1], converts to int16 using safe rounding, and returns both the Blob and encoding diagnostics (e.g., sanitized sample count, clipped sample count)."
        },
        {
          "path": "frontend/src/components/AdvancedAudioEditor.tsx",
          "operation": "modify",
          "description": "Refactor the processing flow to ensure any created AudioContext is closed in a finally block (even on decode/DSP/encode errors), switch encoding to use the hardened wavEncoder utility, and surface clear English warnings/errors when abnormal values are detected (including suggestions to lower DSP strengths or disable the stage flagged by diagnostics when available)."
        },
        {
          "path": "frontend/src/lib/tripleCheckDiagnostics.ts",
          "operation": "modify",
          "description": "Incorporate encoding-step validation into the Triple Check run by using the hardened WAV encoder and (optionally) decoding the encoded WAV back into an AudioBuffer for metric comparison to isolate encode-related artifacts."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Expose a user-facing Diagnostics section in the Advanced Audio Editor to run Triple Check, view results, and export the report locally without backend changes.",
      "acceptanceCriteria": [
        "Advanced Audio Editor includes a Diagnostics UI section that is discoverable and does not block normal processing.",
        "Diagnostics section includes: a button to run Triple Check, a results table/card list for the three checkpoints, and a button to download the report.",
        "All user-facing diagnostics labels and messages are in English.",
        "Diagnostics run does not automatically upload anything to the backend; it is local-only unless the user explicitly uploads/export via existing flows."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdvancedAudioEditor.tsx",
          "operation": "modify",
          "description": "Add a dedicated Diagnostics section to the Advanced Audio Editor UI that (a) provides a Run Triple Check button, (b) displays results via the TripleCheckResults component, and (c) enables local report download; ensure this section is discoverable and does not block the normal processing/export flows. Compose existing shadcn/ui components (do not modify anything under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/TripleCheckResults.tsx",
          "operation": "modify",
          "description": "Ensure the diagnostics UI uses English labels/messages, supports exporting the report as JSON/text, and keeps all data local (no backend calls) unless the user explicitly uses existing export/upload flows. Compose existing shadcn/ui components (do not modify anything under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}