{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Upgrade in-browser audio DSP tools (Web Audio/OfflineAudioContext) with new Dynamic EQ + De-click/De-chirp controls, leaving video editing unchanged",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Upgrade the Web Audio DSP pipeline to include stronger, distinct, parameterized stages for noise suppression, transient suppression, voice/dialogue isolation, spectral repair, dynamic EQ, and de-click/de-chirp (no deep-learning claims).",
      "acceptanceCriteria": [
        "The audio processing pipeline includes distinct stages covering: noise suppression, transient suppression, voice/dialogue isolation, spectral repair, dynamic EQ, and de-click/de-chirp.",
        "Each new/updated DSP stage can be enabled/disabled and parameterized by the editor UI (strength and/or relevant parameters).",
        "All processing runs via browser-native Web Audio (e.g., OfflineAudioContext) and does not claim to implement neural networks, GPU acceleration, or deep learning.",
        "Processing completes successfully for typical user audio files without throwing runtime errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/audioProcessor.ts",
          "operation": "modify",
          "description": "Refactor the current AI-marketed processing into a clearly staged DSP pipeline built on OfflineAudioContext. Add explicit stages for noise/background suppression, transient/impulse suppression, voice/dialogue isolation, spectral repair, dynamic EQ, and de-click/de-chirp, each taking configurable parameters (including 0..1 or 0..100 strength mapping) and emitting DSP-accurate progress labels."
        },
        {
          "path": "frontend/src/lib/dsp/dspTypes.ts",
          "operation": "create",
          "description": "Introduce shared TypeScript types for DSP options (stage toggles + stage parameter structures + strength normalization helpers) used by the editor and audioProcessor."
        },
        {
          "path": "frontend/src/lib/dsp/stageBuilders.ts",
          "operation": "create",
          "description": "Add reusable stage-construction helpers for building Web Audio node chains (e.g., filter banks, gating/compression variants, EQ band builders, transient suppression chain, de-click/de-chirp chain) while keeping all processing browser-native and OfflineAudioContext-compatible."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Wire existing AdvancedAudioEditor strength sliders into the DSP pipeline so slider movement measurably changes processing (not just toggles).",
      "acceptanceCriteria": [
        "Moving each strength slider (0% -> 100%) produces a clearly different output (audible change) while keeping the feature enabled.",
        "The strength values are passed as parameters/options into the processing function (not ignored).",
        "Setting strength to 0% behaves equivalently to disabling that stage (or produces a minimal/no-op effect), and 100% applies the strongest settings supported."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdvancedAudioEditor.tsx",
          "operation": "modify",
          "description": "Pass the existing strength values (noiseSuppressionStrength, transientSuppressionStrength, voiceIsolationStrength, spectralRepairStrength) into the audio processing call as explicit DSP stage parameters (not just booleans). Ensure 0% maps to bypass/minimal settings and 100% maps to the strongest safe settings."
        },
        {
          "path": "frontend/src/lib/audioProcessor.ts",
          "operation": "modify",
          "description": "Update the processing function signature/options to accept per-stage strength/parameter inputs and use them to compute stage settings (e.g., thresholds/Q values/ratios/mix amounts) so output changes continuously with UI slider changes."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Extend AdvancedAudioEditor UI to add Dynamic EQ and De-click/De-chirp controls (Switch + Slider + description) and ensure they affect output when enabled.",
      "acceptanceCriteria": [
        "The editor UI includes clearly labeled controls (English) to enable/disable dynamic EQ and de-click/de-chirp, plus at least one adjustable intensity/strength control for each.",
        "Running processing with these toggles enabled results in an output different from when they are disabled.",
        "UI controls follow the existing pattern (Switch + Slider + short description) and remain responsive during processing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdvancedAudioEditor.tsx",
          "operation": "modify",
          "description": "Add new settings fields and UI sections for Dynamic EQ and De-click/De-chirp following the existing Switch + Slider + short description pattern. Wire these values into the processing call so enabling/disabling and changing strength produces an audible difference."
        },
        {
          "path": "frontend/src/lib/audioProcessor.ts",
          "operation": "modify",
          "description": "Add processing support for Dynamic EQ and De-click/De-chirp stages, including enable/disable behavior and strength-driven parameter mapping that produces a measurable output change."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Replace AI/deep-learning/GPU marketing copy and progress stage labels with accurate DSP wording (English only) in advanced audio UI and audio processing progress labels.",
      "acceptanceCriteria": [
        "`AdvancedAudioEditor.tsx` no longer displays copy such as 'Deep learning-powered', 'AI Enhancement Controls', 'GPU Accelerated', or similar claims; the copy describes DSP processing accurately.",
        "Progress stage labels emitted by the processing function no longer mention AI (e.g., 'Initializing AI Engine...' becomes a DSP-accurate label).",
        "All updated user-facing text is English-only and consistent across the editor (header, descriptions, toasts, and stage labels)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdvancedAudioEditor.tsx",
          "operation": "modify",
          "description": "Replace AI/deep-learning/GPU-acceleration wording with accurate DSP language across titles, descriptions, badges, feature descriptions, button labels, and any toast/progress-related copy while keeping all user-facing text in English."
        },
        {
          "path": "frontend/src/lib/audioProcessor.ts",
          "operation": "modify",
          "description": "Update progress stage labels to be DSP-accurate and consistent with the editor UI (e.g., initialization, analysis, noise suppression, transient suppression, voice isolation, spectral repair, dynamic EQ, de-click/de-chirp, normalization, rendering), avoiding any AI wording."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace the global initialization/loading text that references 'AI Engine' with neutral, DSP-accurate wording to keep user-facing copy consistent and avoid AI claims."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Ensure video editing remains unchanged while upgrading audio DSP (no video UI/behavior/job-history comparison regressions).",
      "acceptanceCriteria": [
        "No code changes are made that alter video editor UI controls, preview behavior, or video job history comparison features.",
        "Manual smoke test: video upload/edit/history flows behave the same as before the DSP upgrades."
      ],
      "file_operations": [
        {
          "path": "frontend/src/docs/video-smoke-test-checklist.md",
          "operation": "create",
          "description": "Add a short manual smoke-test checklist focused on verifying the video upload/edit/history/video-comparison flows remain unchanged after the audio DSP upgrades, without modifying any video editor components."
        }
      ]
    }
  ]
}